tests/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 2
      name: Warm up
    - duration: 20
      arrivalRate: 1
      rampTo: 15
      name: Ramp up load
    - duration: 30
      arrivalRate: 15
      name: Sustained load

scenarios:
  - name: "Pie chart"
    flow:
      - post:
          url: "/"
          json: {
                  "chart": {
                    "type": "pie",
                    "data": [
                      {"x": "Apples", "value": "128.14", "fill": "green"},
                      {"x": "Oranges", "value": "128.14", "fill": "orange"}
                    ]
                  }
                }