tests/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 5
      name: Warm up
    - duration: 40
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 40
      arrivalRate: 10
      name: Sustained load

scenarios:
  - name: "Pie chart"
    flow:
      - post:
          url: "/"
          json:
            {
              "chart":
                {
                  "type": "pie",
                  "data":
                    [
                      { "x": "Apples", "value": "128.14", "fill": "green" },
                      { "x": "Oranges", "value": "128.14", "fill": "orange" },
                    ],
                }
            }